#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.google_pubsub_topic.pubsub-basic: Refreshing state... [id=projects/cq-provider-gcp/topics/cq-topic]
module.test.data.google_compute_zones.available: Reading...
module.test.google_kms_crypto_key.key-us-east1: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/keyRings/cq-keyring/cryptoKeys/cq-cryptokey]
module.test.google_kms_key_ring.keyring-us-east1: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/keyRings/cq-keyring]
module.test.data.google_compute_zones.available: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.test.google_compute_backend_service.another-backend-service will be created
  + resource "google_compute_backend_service" "another-backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "cq-another-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "SSL"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_backend_service.backend-service will be created
  + resource "google_compute_backend_service" "backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "cq-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_backend_service.internal-backend-service will be created
  + resource "google_compute_backend_service" "internal-backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "INTERNAL_SELF_MANAGED"
      + name                            = "cq-internal-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_https_health_check.backend-service-health-check will be created
  + resource "google_compute_https_health_check" "backend-service-health-check" {
      + check_interval_sec  = 60
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "cq-health-check"
      + port                = 443
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 1
      + unhealthy_threshold = 2
    }

  # module.test.google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "cq-compute"
      + project              = "cq-provider-gcp"
      + self_link            = (known after apply)
      + tags                 = [
          + "health-check",
          + "ssh",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-east1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # module.test.google_compute_instance_group.test will be created
  + resource "google_compute_instance_group" "test" {
      + description = "Integration test instance group"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "cq-instance-group"
      + network     = (known after apply)
      + project     = (known after apply)
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "us-east1-b"
    }

  # module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert will be created
  + resource "google_compute_managed_ssl_certificate" "gcp_compute_managed_ssl_certificates_cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "cq-managed-cert"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "cloudquery.dev",
              + "ex.cloudquery.dev",
            ]
        }
    }

  # module.test.google_compute_router.vpn_router will be created
  + resource "google_compute_router" "vpn_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-us-east1-compute-vpn-router"
      + network            = "cq-compute-vpc"
      + project            = "cq-provider-gcp"
      + region             = "us-east1"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode     = "DEFAULT"
          + asn                = 64519
          + keepalive_interval = 20
        }
    }

  # module.test.google_compute_ssl_policy.ssl-policy will be created
  + resource "google_compute_ssl_policy" "ssl-policy" {
      + creation_timestamp = (known after apply)
      + enabled_features   = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + min_tls_version    = "TLS_1_0"
      + name               = "cq-ssl-policy"
      + profile            = "MODERN"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies will be created
  + resource "google_compute_target_http_proxy" "gcp_compute_target_http_proxies" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-http-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies will be created
  + resource "google_compute_target_https_proxy" "gcp_compute_target_https_proxies" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-https-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = []
      + ssl_policy         = (known after apply)
      + url_map            = (known after apply)
    }

  # module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy will be created
  + resource "google_compute_target_ssl_proxy" "gcp_compute_target_ssl_proxies_proxy" {
      + backend_service    = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-ssl-proxy"
      + project            = (known after apply)
      + proxy_header       = "NONE"
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
    }

  # module.test.google_compute_url_map.external_url_map will be created
  + resource "google_compute_url_map" "external_url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "cq-external-urlmap"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "ex.cloudquery.dev",
            ]
          + path_matcher = "external-1"
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "external-1"

          + path_rule {
              + paths   = [
                  + "/home",
                ]
              + service = (known after apply)
            }
        }
    }

  # module.test.google_compute_url_map.url_map will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "cq-urlmap"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "beta.cloudquery.dev",
            ]
          + path_matcher = "secondary"
        }
      + host_rule {
          + hosts        = [
              + "cloudquery.dev",
            ]
          + path_matcher = "root"
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "root"

          + path_rule {
              + paths = [
                  + "/home",
                ]

              + route_action {

                  + weighted_backend_services {
                      + backend_service = (known after apply)
                      + weight          = 400

                      + header_action {
                          + request_headers_to_remove  = [
                              + "RequestHeaderToRemove",
                            ]
                          + response_headers_to_remove = [
                              + "ResponseHeaderToRemove",
                            ]

                          + request_headers_to_add {
                              + header_name  = "RequestHeaderToAdd"
                              + header_value = "RequestHeaderToAddValue"
                              + replace      = true
                            }

                          + response_headers_to_add {
                              + header_name  = "ResponseHeaderToAdd"
                              + header_value = "ResponseHeaderToAddValue"
                              + replace      = false
                            }
                        }
                    }
                }
            }
          + path_rule {
              + paths   = [
                  + "/login",
                ]
              + service = (known after apply)
            }
          + path_rule {
              + paths   = [
                  + "/static",
                ]
              + service = (known after apply)
            }
        }
      + path_matcher {
          + default_service = (known after apply)
          + name            = "secondary"
        }

      + test {
          + host    = "beta.cloudquery.dev"
          + path    = "/healthcheck"
          + service = (known after apply)
        }
    }

  # module.test.google_kms_crypto_key.key-us-east1 will be destroyed
  # (because google_kms_crypto_key.key-us-east1 is not in configuration)
  - resource "google_kms_crypto_key" "key-us-east1" {
      - destroy_scheduled_duration    = "86400s" -> null
      - id                            = "projects/cq-provider-gcp/locations/us-east1/keyRings/cq-keyring/cryptoKeys/cq-cryptokey" -> null
      - import_only                   = false -> null
      - key_ring                      = "projects/cq-provider-gcp/locations/us-east1/keyRings/cq-keyring" -> null
      - labels                        = {} -> null
      - name                          = "cq-cryptokey" -> null
      - purpose                       = "ENCRYPT_DECRYPT" -> null
      - skip_initial_version_creation = false -> null

      - version_template {
          - algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION" -> null
          - protection_level = "SOFTWARE" -> null
        }
    }

  # module.test.google_kms_key_ring.keyring-us-east1 will be destroyed
  # (because google_kms_key_ring.keyring-us-east1 is not in configuration)
  - resource "google_kms_key_ring" "keyring-us-east1" {
      - id       = "projects/cq-provider-gcp/locations/us-east1/keyRings/cq-keyring" -> null
      - location = "us-east1" -> null
      - name     = "cq-keyring" -> null
      - project  = "cq-provider-gcp" -> null
    }

  # module.test.google_pubsub_topic.pubsub-basic will be destroyed
  # (because google_pubsub_topic.pubsub-basic is not in configuration)
  - resource "google_pubsub_topic" "pubsub-basic" {
      - id      = "projects/cq-provider-gcp/topics/cq-topic" -> null
      - labels  = {} -> null
      - name    = "cq-topic" -> null
      - project = "cq-provider-gcp" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip will be created
  + resource "google_compute_address" "vpn_gw_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ip-cq-compute"
      + network_tier       = (known after apply)
      + project            = "cq-provider-gcp"
      + purpose            = (known after apply)
      + region             = "us-east1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp will be created
  + resource "google_compute_forwarding_rule" "vpn_esp" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "ESP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-esp"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500 will be created
  + resource "google_compute_forwarding_rule" "vpn_udp4500" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-udp4500"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "4500"
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500 will be created
  + resource "google_compute_forwarding_rule" "vpn_udp500" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-udp500"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "500"
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_route.route[0] will be created
  + resource "google_compute_route" "route" {
      + dest_range             = "10.10.12.0/24"
      + id                     = (known after apply)
      + name                   = "cq-compute-tunnel1-route1"
      + network                = (known after apply)
      + next_hop_instance_zone = (known after apply)
      + next_hop_ip            = (known after apply)
      + next_hop_network       = (known after apply)
      + next_hop_vpn_tunnel    = (known after apply)
      + priority               = 1000
      + project                = "cq-provider-gcp"
      + self_link              = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway will be created
  + resource "google_compute_vpn_gateway" "vpn_gateway" {
      + creation_timestamp = (known after apply)
      + gateway_id         = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-compute"
      + network            = (known after apply)
      + project            = "cq-provider-gcp"
      + region             = "us-east1"
      + self_link          = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0] will be created
  + resource "google_compute_vpn_tunnel" "tunnel-static" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = [
          + "0.0.0.0/0",
        ]
      + name                    = "cq-compute-tunnel-1"
      + peer_ip                 = "1.1.1.1"
      + project                 = "cq-provider-gcp"
      + region                  = "us-east1"
      + remote_traffic_selector = [
          + "0.0.0.0/0",
        ]
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + target_vpn_gateway      = (known after apply)
      + tunnel_id               = (known after apply)
    }

  # module.test.module.vpn-manage-internal.random_id.ipsec_secret will be created
  + resource "random_id" "ipsec_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.10.20.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-compute-subnet-01"
      + network                    = "cq-compute-vpc"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "Private network for cq-provider-gcp/compute"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "cq-compute-vpc"
      + project                         = "cq-provider-gcp"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 24 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @shimonp21, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*